[M_ClapTrapBeard MissionDefinition]
MissionDescription="Claptrap needs a beard to increase his magic power. As he is a robot, however, he's incapable of growing one.<br><br>He's asked you to kill some dwarves in [place]Mines of Avarice[-place] by luring them into the mining equipment. If you can collect some of the bloody facial hair that results from the carnage, you can forge it into a brand-new beard!"
TurnInDescription="If you have a full beard and a robe, you're a wizard. A robe and a goatee, you're a warlock. A robe and a mustache? You're not allowed near public schools."

[M_ClapTrapBeard:CollectBeards MissionObjectiveDefinition]
ProgressMessage="Collect beards"

[M_ClapTrapBeard:CollectMagicBeard MissionObjectiveDefinition]
ProgressMessage="Collect magic beard"

[M_ClapTrapBeard:LeadDwarvesMachinery MissionObjectiveDefinition]
ProgressMessage="Crush drunk dwarves"

[M_ClapTrapBeard:ObjSet_PutPiecesForge MissionObjectiveSetDefinition]
MissionDescriptionOverride="Claptrap needs a beard to increase his magic power. As he is a robot, however, he's incapable of growing one.<br><br><br>Having collected some dwarven facial hair, Claptrap has asked you to head to the Dwarven Beard Forger 9000 and forge a new beard for him."

[M_ClapTrapBeard:StrikeForge MissionObjectiveDefinition]
ProgressMessage="Strike forge"
